import React from "react";
import Header from "../Header";
import Jumbo from "../Jumbo/Jumbo";
import ActionContainer from "./../ActionContainer";
import "./App.css";
import "./../../assets/styles/index.scss";
import MainActivites from "../sections/MainActivites/MainActivites";

const list = [
  "Прийняття участі у розробці законопроектів, стандартів і вимог, що стосуються психологічного консультування та травматерапії",
  "впровадження етичних стандартів клінічної практики",
  "організація навчання, проведення курсів, семінарів, зустрічей, лекцій та інших освітніх програм в Україні відповідно до міжнародних стандартів",
  "сприяння підвищенню професійного рівня спеціалістів в області психологчного консультування та травматерапії у відповідності до міжнародних стандартів",

  "впровадження нових методів психології у сфері психологічного консультування та травматерапії",
  "сприяння інформаційному забезпеченню психологів, обміну досвідом дослідницької і практичної діяльності, освоєння прогресивних форм роботи",
  "впровадження та підтримка дослідницьких проектів з питань психологічного консультування та травматерапії",
  "розробка й реалізація проектів і програм, що передбачають надання правової, соціальної та гуманітарної допомоги громадянам України, громадянам інших держав та особам без громадянства",
  "розвиток культури звернення за психологічною допомогою",
];

const App = () => {
  return (
    <div className="App">
      <Header />
      <Jumbo />
      <main>
        <ActionContainer />
        <MainActivites list={list} title={"Основні напрями діяльності Асоціації"}/>
      </main>
    </div>
  );
};

export default App;
